/*************************************************************************
	> File Name: 11_money.c
	> Author: csgec
	> Mail: 12345678@qq.com 
	> Created Time: 2023年07月15日 星期六 14时34分59秒
 ************************************************************************/

/*
	海贼理工学院的老师让同学们排成一个 n∗m的长方形队，
	每一个同学手边都拿一个捐款袋，袋子里面有一定数的硬币。​
	现已知所有同学的捐款袋的钱数，数值为整数，单位：元。
	要求输出每一列同学捐款袋里面的钱数的和
*/
 
#include<stdio.h>

int main()
{
	int n,m;
	scanf("%d %d",&n,&m);
	
	int arr[n][m];
	
	for(int i=0;i<n;i++)
		for(int j=0;j<m;j++)
			scanf("%d",&arr[i][j]);
		
	// 1 2 3
	// 2 3 4
	
	for(int i=0;i<m;i++)
	{
		int sum = 0;
		for(int j=0;j<n;j++)
			sum += arr[j][i];
		printf("%d\n",sum);
	}
	
	return 0;
	
}

